sencercoltu/openvr-customhmd/stm32/TrackedDevice/Src/main.c
	uint8_t SensorCalibRequest = 0xFF;
	uint32_t eepromSaveTime = 0;
	
	while (true)
	{	
		Blink(blinkDelay);
		blinkDelay = 1000;
		
		now = HAL_GetMicros();
		ticks = now / 1000;
		
		if (eepromSaveTime && eepromSaveTime >= ticks)
		{
			CalibrateSensors();
			calibrationCache.Magic = VALID_EEPROM_MAGIC;
			enableEEPROMWriting();
			char *eepromData = (char *)&calibrationCache;	
			int addr = 0;
			for (int i=0; i<sizeof(calibrationCache); i+=sizeof(uint32_t))
			{
				writeEEPROMWord(addr, *((uint32_t *)(&eepromData[i])));
				addr += sizeof(uint32_t);
			}
			disableEEPROMWriting();
			eepromSaveTime = 0;
		}
		
		//if ((ctlSource == RIGHTCTL_SOURCE || ctlSource == LEFTCTL_SOURCE))
		//{
			if (ticks - lastADCAverages >= 50) //20 analog values per second
			{
				lastADCAverages = ticks;
				for (int i=0; i<3; i++)
				{
					ADC_Averages[i] = (ADC_Averages[i] * 0.1f) + ((float)ADC_Values[i] * 0.9f); //basic complementary filter
					int32_t value = (int32_t)((ADC_Averages[i] - ADC_Offsets[i]) / 20.48f) ;			
					if (ADC_Cache[i] != value)
					{
						//if any analog value has changes
						ADC_Cache[i] = value;
						//hasTriggerData = true;
						buttonRetransmit = 5;					
						lastButtonRefresh = ticks;
					}
				}
			}
			if (LastDigitalChange && (ticks - LastDigitalChange >= 25)) //using sw debounce 
			{			
				LastDigitalChange = 0;
				DigitalValues = 0;
				if (HAL_GPIO_ReadPin(CTL_BTN0_GPIO_Port, CTL_BTN0_Pin) == GPIO_PIN_SET) DigitalValues |= BUTTON_0;
				if (HAL_GPIO_ReadPin(CTL_BTN1_GPIO_Port, CTL_BTN1_Pin) == GPIO_PIN_SET) DigitalValues |= BUTTON_1;
				if (HAL_GPIO_ReadPin(CTL_BTN2_GPIO_Port, CTL_BTN2_Pin) == GPIO_PIN_SET) DigitalValues |= BUTTON_2;
				if (HAL_GPIO_ReadPin(CTL_BTN3_GPIO_Port, CTL_BTN3_Pin) == GPIO_PIN_SET) DigitalValues |= BUTTON_3;
				
				if (DigitalCache != DigitalValues)
				{
					//if any digital value has changes
					DigitalCache = DigitalValues;
					//hasTriggerData = true;
					buttonRetransmit = 5;
					lastButtonRefresh = ticks;
				}
			}
			
			if (ticks - lastButtonRefresh >= buttonRefreshTimeout)
			{
				//update button status every 250ms.
				buttonRetransmit++;
				lastButtonRefresh = ticks;
			}
		//}
		
		if (vibrationStopTime0 && (ticks > vibrationStopTime0))
		{
			HAL_GPIO_WritePin(CTL_VIBRATE0_GPIO_Port, CTL_VIBRATE0_Pin, GPIO_PIN_RESET);
			vibrationStopTime0 = 0;
		}
		
		if (vibrationStopTime1 && (ticks > vibrationStopTime1))
		{
			HAL_GPIO_WritePin(CTL_VIBRATE1_GPIO_Port, CTL_VIBRATE1_Pin, GPIO_PIN_RESET);
			vibrationStopTime1 = 0;
		}

		float elapsedTime = (now - lastRotationUpdate) / 1000000.0f; // set integration time by time elapsed since last filter update				
		
		if (elapsedTime >= 0.005f) //update at 200hz
		{	
			hasRotationData |= readAccelData(tSensorData.Accel.Raw);  // Read the x/y/z adc values			
			hasRotationData |= readGyroData(tSensorData.Gyro.Raw); 
			hasRotationData |= readMagData(tSensorData.Mag.Raw);
					
			
			if (hasRotationData) // recalc position if still has position data to be sent
			{
				tSensorData.Accel.ProcessNew();
				tSensorData.Gyro.ProcessNew();
				tSensorData.Mag.ProcessNew();
				
				tSensorData.TimeElapsed = elapsedTime;
				lastRotationUpdate = now;	
				orientQuat = orientFuse.FuseOrient(&tSensorData);						

				//gravQuat = orientQuat;
//				gravQuat.w = 0; gravQuat.x = 0; gravQuat.y = 0; gravQuat.z = 0;
//				gravQuat = (orientQuat * gravQuat) * orientQuat.conjugate();

				if (isPositionReady && (hasPositionData || (isCalibrated && (ticks >= 10000))))
				{
					//float elapsedPositionTime = (float)(now - lastPositionIntegrateTime) / 1000000.0f;
					//if (elapsedPositionTime >= 0.001f) // integrate every 2 ms
					{
						GravityVector[0] = 2.0f * (orientQuat.x * orientQuat.z - orientQuat.w * orientQuat.y);
						GravityVector[1] = 2.0f * (orientQuat.w * orientQuat.x + orientQuat.y * orientQuat.z);
						GravityVector[2] = orientQuat.w * orientQuat.w - orientQuat.x * orientQuat.x - orientQuat.y * orientQuat.y + orientQuat.z * orientQuat.z;
						
						for (int i=0; i<3; i++)
						{
							float prevAccel = CompAccelVector[i];
							float prevVelocity = VelocityVector[i];																									
							float newAccel = tSensorData.Accel.Converted[i] - GravityVector[i];
							float newVelocity = ((prevAccel + newAccel) / 2.0f) * 9.81f * elapsedTime;		
							float prevPosition = position.Position[i];
							
							//if velocity changes direction hold for a moment
//							if (sgn(prevVelocity) != sgn(newVelocity))
//							{
//								newVelocity = prevVelocity = 0;
//								//newAccel = 0;
//							}
							
							
							position.Position[i] = prevPosition + ((prevVelocity + newVelocity) / 2.0f) * elapsedTime * 10.0f;											
							CompAccelVector[i] = newAccel;
							VelocityVector[i] = prevVelocity + newVelocity;							
						}	
						
						//if (now - lastPositionSend >= 20000) //50 ms
						{
							positionQuat.w = 0;
							positionQuat.x = position.Position[0];
							positionQuat.y = position.Position[1];
							positionQuat.z = position.Position[2];
							
							positionQuat = (orientQuat * positionQuat) * orientQuat.conjugate();
							
							hasPositionData = 1;							
							//lastPositionSend = now;	
						}
						
						//lastPositionIntegrateTime = now;
					}
				}
				//else
				//	lastPositionIntegrateTime = now;
			}
		}

		rfStatus = RF_Status(&hspi2);
		readyToReceive = (rfStatus & RF_RX_DR_IRQ_CLEAR) == RF_RX_DR_IRQ_CLEAR ? 1 : 0;

		if (readyToReceive)
		{
			rfStatus = RF_FifoStatus(&hspi2);
			readyToReceive = (rfStatus & RF_RX_FIFO_EMPTY_Bit) == 0x00 ? 1: 0;
			while (readyToReceive)
			{			
				rcvCounter++;
				//receive command
				//has fifo, receive
				readyToReceive = RF_ReceivePayload(&hspi2, (uint8_t*)pUSBCommandPacket, sizeof(USBPacket)) == 0 ? 1: 0; //if not empty 
				
